# Данные меню кофейни

MENU = {
    "☕ КЛАССИЧЕСКИЙ КОФЕ": {
        "Эспрессо": {
            "volumes": {"60мл": 199}
        },
        "Американо": {
            "volumes": {"250мл": 199, "350мл": 249, "450мл": 299}
        },
        "Капучино": {
            "volumes": {"350мл": 249, "450мл": 299}
        },
        "Латте": {
            "volumes": {"350мл": 249, "450мл": 299}
        },
        "Флэт уайт": {
            "volumes": {"250мл": 249, "350мл": 299}
        },
        "Кофе Раф": {
            "volumes": {"350мл": 299, "450мл": 349}
        },
        "Моккачино": {
            "volumes": {"350мл": 299, "450мл": 349}
        }
    },

    "🔥 ГОРЯЧИЕ НАПИТКИ": {
        "Глинтвейн б/а": {
            "volumes": {"350мл": 219, "450мл": 249}
        },
        "Пунш облепиховый": {
            "volumes": {"350мл": 219, "450мл": 249}
        },
        "Пунш лимон-имбирь": {
            "volumes": {"350мл": 219, "450мл": 249}
        },
        "Пунш малина шиповник": {
            "volumes": {"350мл": 219, "450мл": 249}
        },
        "Пунш клюква можжевельник": {
            "volumes": {"350мл": 219, "450мл": 249}
        }
    },

    "⭐ АВТОРСКИЙ КОФЕ": {
        "Раф булочка с малиной": {
            "volumes": {"350мл": 299, "450мл": 349}
        },
        "Раф халва": {
            "volumes": {"350мл": 299, "450мл": 349}
        },
        "Раф арахисовая нуга": {
            "volumes": {"350мл": 299, "450мл": 349}
        },
        "Раф медовый персик": {
            "volumes": {"350мл": 299, "450мл": 349}
        },
        "Латте соленая ириска": {
            "volumes": {"350мл": 299, "450мл": 349}
        },
        "Латте пряная груша": {
            "volumes": {"350мл": 299, "450мл": 349}
        },
        "Латте карамельный попкорн": {
            "volumes": {"350мл": 299, "450мл": 349}
        },
        "Горячий бамбл": {
            "volumes": {"350мл": 249, "450мл": 299}
        }
    },

    "🍵 НЕ КОФЕ": {
        "Чай (чёрный/зелёный/фруктовый)": {
            "volumes": {"350мл": 99}
        },
        "Матча латте": {
            "volumes": {"350мл": 249, "450мл": 299}
        },
        "Какао": {
            "volumes": {"350мл": 219, "450мл": 249}
        },
        "Бэйбичино": {
            "volumes": {"250мл": 149, "350мл": 199}
        },
        "Горячий шоколад": {
            "volumes": {"250мл": 249, "350мл": 299}
        },
        "Молочный коктейль": {
            "volumes": {"350мл": 219, "450мл": 249}
        }
    }
}

EXTRAS = {
    "➕ ДОБАВКИ": {
        "Молоко Alt 80мл": 80,
        "Молоко Alt 90мл": 90,
        "Молоко Alt 100мл": 100,
        "Кофе без кофеина 50мл": 50,
        "Кофе без кофеина 70мл": 70,
        "Кофе без кофеина 90мл": 90,
        "Сироп": 51,
        "Сливки": 51,
        "Орехи": 51,
        "Шот эспрессо 30мл": 99
    }
}
